Autodesk.Revit.DB.RoofTypeSet
A set that contains roof types.

Autodesk.Revit.DB.RoofTypeSet.Insert(Autodesk.Revit.DB.RoofType)
System.Int32
Insert the specified roof type into the set.
item: The roof type to be inserted into the set.
Returns: Returns whether the roof type was inserted into the set.

Autodesk.Revit.DB.RoofTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.RoofTypeSet.ReverseIterator
Autodesk.Revit.DB.RoofTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.RoofTypeSet.ForwardIterator
Autodesk.Revit.DB.RoofTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.RoofTypeSet.Erase(Autodesk.Revit.DB.RoofType)
System.Int32
Removes a specified roof type from the set.
item: The roof type to be erased.
Returns: The number of roof types that were erased from the set.

Autodesk.Revit.DB.RoofTypeSet.Contains(Autodesk.Revit.DB.RoofType)
System.Boolean
Tests for the existence of a roof type within the set.
item: The roof type to be searched for.
Returns: The Contains method returns True if the roof type is within the set, otherwise False.

Autodesk.Revit.DB.RoofTypeSet.Clear
void
Removes every roof type from the set, rendering it empty.

Autodesk.Revit.DB.RoofTypeSet.Size
System.Int32
get
Returns the number of roof types that are in the set.

Autodesk.Revit.DB.RoofTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.